app/views/home/_news_section.html.erb

  <div class="container">
    <%= render partial: 'news/tile', collection: News.all, as: :news  %>
---
SELECT "news".* FROM "news"