app/views/home/_podcast_section.html.erb

SELECT "podcasts".* FROM "podcasts"
---
    <div class="container">
      <%= render partial: "podcasts/tile", collection: Podcast.all, as: :podcast %>