app/views/home/index.html.erb

  <div class="container">
  <% Event.all.each do |event|%>
---
SELECT "events".* FROM "events"

  <div class="container">
    <% News.all.each do |news|%>
---
SELECT "news".* FROM "news"

    <div class="container">
      <% Podcast.all.each do |podcast|%>
---
SELECT "podcasts".* FROM "podcasts"