app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
<h2 class="upcoming-title">Upcoming Event</h2>
<% Event.all.each do |event|%>