app/views/news/index.html.erb

<h2 class="bridge-news-title">Bridge Church News</h2>
  <% News.all.each do |news| %>
---
SELECT "news".* FROM "news"