app/views/campuses/location.html.erb


<% Campus.all.each_with_index do |campus, i| %>
---
SELECT "campuses".* FROM "campuses"

      <% service_day = [] %>
      <% campus.service.each do |service| %>
        <% campuses = Service.all.map {|service| service.campus_id } %>
---
SELECT "services".* FROM "services" WHERE "services"."campus_id" = ?  [["campus_id", 31]]
SELECT "campuses".* FROM "campuses"