app/controllers/events_controller.rb

  def create
    event = Event.new
    event.image_url = params[:image_url]
    event.date = params[:date]
    event.title = params[:title]
    event.speaker = params[:speaker]
    event.campus_id = params[:campus_id]
    event.address = params[:address]
    event.save!
---
INSERT INTO "events" ("image_url", "date", "speaker", "campus_id", "address", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @event = Event.find_by(id: params[:id]) || nil
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    if !current_user.is_admin
      render_404
    else
      @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    event = Event.find_by(id: params[:id])
    event.image_url = params[:image_url]
    event.date = params[:date]
    event.title = params[:title]
    event.speaker = params[:speaker]
    event.campus_id = params[:campus_id]
    event.address = params[:address]
    event.save!
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "events" SET "image_url" = ?, "date" = ?, "speaker" = ?, "address" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["image_url", "e"], ["date", "2019-11-01 19:00:00"], ["speaker", "ps corey"], ["address", "hello"], ["updated_at", "2019-08-19 05:11:04.618870"], ["id", 4]]