app/controllers/events_controller.rb

  def show
    @event =  Event.find_by(id: params[:id]) || nil
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]