app/controllers/news_controller.rb

  def show
    @news = News.find_by(id: params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]