app/controllers/news_controller.rb

  def create
    news = News.new
    news.image_url = params[:image_url]
    news.date = params[:date]
    news.title = params[:title]
    news.description = params[:description]
    news.campus_id = params[:campus_id]
    news.save!
---
INSERT INTO "news" ("image_url", "date", "title", "description", "campus_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @news = News.find_by(id: params[:id]) || nil
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]

  def update
    news = News.find_by(id: params[:id])
    news.image_url = params[:image_url]
    news.date = params[:date]
    news.title = params[:title]
    news.description = params[:description]
    news.campus_id = params[:campus_id]
    news.save!
---
UPDATE "news" SET "campus_id" = ?, "updated_at" = ? WHERE "news"."id" = ?  [["campus_id", 2], ["updated_at", "2019-08-21 05:40:03.058253"], ["id", 6]]

  def destroy
    news = News.find(params[:id]).destroy
---
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 6]]