app/controllers/podcasts_controller.rb

  def create
    podcast = Podcast.new
    podcast.date = params[:date]
    podcast.title = params[:title]
    podcast.url = params[:url]
    podcast.campus_id = params[:campus_id]
    podcast.save!
---
INSERT INTO "podcasts" ("date", "title", "url", "campus_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2019-10-02 09:00:00"], ["title", "djlksl"], ["url", "dnlskjl"], ["campus_id", 1], ["created_at", "2019-08-22 02:49:54.391616"], ["updated_at", "2019-08-22 02:49:54.391616"]]

  def destroy
    @podcast = Podcast.find(params[:id])
    @podcast.destroy
---
DELETE FROM "podcasts" WHERE "podcasts"."id" = ?  [["id", 6]]