app/controllers/users_controller.rb

  def create
    user = User.new
    user.is_admin = false
    user.name = params[:name]
    user.email = params[:email]
    user.password = params[:password]
    user.save!
---
INSERT INTO "users" ("is_admin", "name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def sign_in
    user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kiki@example.com"], ["LIMIT", 1]]