app/views/podcasts/index.html.erb

<h2 id="podcast-title">Bridge Church Podcasts</h2>
<% Podcast.all.each do |podcast|%>
---
SELECT "podcasts".* FROM "podcasts"